<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN"
"http://style.tigris.org/tigris_transitional.dtd">
<html>
<head>
  <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
  <title>Getting started with the Project Looking Glass Developer's Release</title>
  <style type="text/css">
  <!--
    table, th, td {
	border-style: none;
    }
    table {background-color:#eee}
    th {font-family:lucida,arial,sans-serif; color:#fff; background-color:#8b8}
    td {font-family:lucida,arial,sans-serif; color:#333; background-color:#fff}
  -->
  </style>
</head>
<body>
<div id="projectdocumentview" class="app">

<h3>Einstieg in das Projekt Looking Glass (Entwickler Version) </h3>

<p>
  <b>Willkommen beim Project Looking Glass!</b>
</p>

<p>
  Dieses Dokument dient als Anleitung wie du am schnellsten die Entwicklerversion von
  Looking Glass unter Linux oder Solaris x86 Maschinen zum laufen bekommst.
  Um den Installation Proze&szlig; erheblich zu vereinfachen, wird das LG3D Mega-bundle zur Verf&uuml;gung gestellt. Dieses Dokument beschreibt wie die Installation und wie das Bundle genutzt wird.
</p>
<p>
Um zu beginnen, stelle erst einmal fest, ob dein System richtig eingestellt ist.
Obgleich die Graphiktreiberkonfiguration sehr tricky sein könnte, ist die tats&auml;chliche Installation von LG3D selbst sehr einfach.
Zum konfigurieren, installieren und laufen von LG3D folge den Schritten:
</p>

<img src="../images/misc/lg3d-pic-300x300.jpg" width="150" border="0" style="float: right;"/>

<blockquote><small>
<ol>
  <li><a href="#Requirements">Platform Requirements</a></li>
  <li><a href="#Installation">Downloading & Installing LG3D</a></li>
  <li><a href="#Running">Running LG3D</a></li>
  <li><a href="#Resources">Useful Links</a></li>
  <li><a href="#FinalWords">Some Final Words...</a></li>
</ol>
<ul>
  <li><a href="#ColorDepth">APPENDIX A: Color Depth Configuration</a></li>
  <li><a href="#BringingDownX">APPENDIX B: Bringing Down X Session</a></li>
  <li><a href="#Troubleshooting">APPENDIX C: Troubleshooting</a></li>
</ul>
</small></blockquote>


<h3><a name="Platform_Requirements"></a>1. Systemvoraussetzungen</h3>
<p>
Bevor du dein Projekt Looking Glass starten kannst, 
solltest du schauen das du die minimalen Systemvorraussetzungen erf&uuml;llst
 um einen Problemlosen Start zu gew&auml;hrleisten.
</p>
<center><small>
  <table border="1" cellpadding="2" cellspacing="2" width="90%"> 
      <tr> 
        <th valign="top">Komponente</th> 
        
        <th valign="top">Voraussetzungen</th> 
      </tr> 
      <tr> 
        <th valign="top">Betriebssystem</th> 
        <td valign="top">
          <p>
            <b>Linux x86:</b> Die meisten aktuellen Linux Distributionen sollten laufen.
          </p>
          <p>
            <b>Solaris x86:</b> Unterst&uuml;tzt Solaris x86 S10_b74 (oder neuer). 
          </p>
        </td> 
      </tr> 
      <tr> 
        <th valign="top">CPU</th> 
        <td valign="top">1.4 GHz oder schneller empfohlen</td> 
      </tr> 
      <tr> 
        <th valign="top">RAM</th> 
        <td valign="top">512MB empfohlen</td> 
      </tr> 
      <tr>
        <a name="RequirementsGraphicsCard"></a>
        <th valign="top">Graphikkarte</th> 
        <td valign="top">
          <p>
	3D beschleunigte Graphikkarte, mit mindestens 32MB VRAM und Treiberunterst&uuml;tzung f&uuml;r OpenGL,
	Version 1.3 oder h&ounl;her (LG3D kann mit OpenGL 1.2 laufen, aber 1.3 wird unbedingt empfohlen). 
	Anzeige 24bit Tiefe wird ben&ouml;tigt, damit die Integration mit X11 richtig arbeiten kann. 
          </p>
          <p>
            <b>Linux x86:</b> 
	F&uuml;r Nvidiakarten muss mindestens der Treiber in der Version <a href="http://www.nvidia.com/object/linux_display_ia32_1.0-6629.html">1.0-6629</a> verwendet werden. Lies dazu <a href="nvidia-driver-install-tips.html">hier</a> f&uuml;r mehr informationen.
	<b>Es ist sehr wichtig diese Infos zu lesen wenn du auf diesen Treiber wechselst, da LG3D eine bestimmte Konfiguration des Treibers 		zum laufen ben&ouml;tigt.
	</b>
          </p>
          <p>
            <b>Solaris x86:</b> 
	Zu der Zeit dieses Schreibens sind die einzige Art der Graphikkarten mit OpenGL Unterstützung auf Solaris x86 bestimmte Nvidia Karten 		(unten zu sehen)
            Du mußt mindestens die folgende Treiberversion verwenden : 
            <a href="http://www.nvidia.com/object/solaris_display_archive.html">1.0-8756 (oder neuer)</a>. 
            Schaue <a href="nvidia-driver-install-tips-solx86.html">hier</a> 
            f&uuml;r mehr informationen. Momentan werden nur die folgenden Nvidia Graphikarten durch den Solaris x86 Treiber unterst&uuml;tzt:
            <ul>
              <li>Quadro FX 4000</li>
              <li>Quadro FX 3000</li>
              <li>Quadro FX 1100</li>
              <li>Quadro FX 500</li>
              <li>NVS 280</li>
            </ul>
          </p>
          <p>
            If you are successful in getting LG3D to run 
            on other cards, or want to report problems with specific cards, 
            please let us know using
            <a href="http://forums.java.net/jive/forum.jspa?forumID=80">
            the discussion forum</a>
          </p>
        </td> 
      </tr> 
      <tr> 
        <th valign="top">Festplattenplatz</th> 
        <td valign="top">350MB</td> 
      </tr> 
  </table>
</small></center>
<br />

<h3><a name="Installation"></a>2. Downloaden & Installieren von LG3D</h3> 

<p>
Das Projekt, Looking Glass, ist in einer Anzahl von Formaten vorhanden, einschlie&szlig;lich Debian .deb Pakete, bin&auml;re Bundle und Solaris Pakete. Die bin&auml;ren Bundle und die Debian Pakete enthalten alles, das erfordert wird, um lg3d (JRE, Java3D und LG3D) auf einem OS laufen zu lassen, das das entsprechende OpenGL installiert hat.
</p>
Auf Debian basierende Linux Distros (wie Ubuntu) wird empfohlen, da&szlig; du die Debian Pakete (.deb) benutzt, um LG3D zu installieren. Auf den anderen Linux Distros und Solaris x86 ist die bevorzugte Weise des Downloadens und des Installierens von LG3D, die Bundle zu benutzen. Das LG3D Bundle bringt alles mit, das du zum laufen lassen von LG3D ben&ouml;tigst, einschlie&szlig;lich das JRE und das Java 3D. Obgleich es recht gro&szlig; ist, vereinfacht es deinen Installations Proze&szlig;. 
</p>
<p>
  Andere LG3D Versionen k&ouml;nnen in der "Stable build section" gefunden werden: 
  <a href="https://lg3d-core.dev.java.net/binary-builds.html">
    Die Bin&auml;r Pakete Seite
  </a>.
  F&uuml;r Ver&ouml;ffentlichungsdetails, 
  schaue bitte in die <a href="release-notes.html">Release Notes</a></b>.
</p>

<h4><a name="Megabundle"></a>2.1 Installieren von LG3D mit dem Megabundle</h4> 
 <p>
  Der LG3D Mega-bundle Installer installiert LG3D und alle ben&ouml;tigten Komponenten inklusive JRE and Java 3D.

  Beachte das der Installer JRE und Java 3D in ein LG3D spezifisches Veriechnis (<tt>/usr/share</tt>) kopiert.
  Der Vorteil ist, das somit keine ver&auml;nderungen an der Bestehenden Java Umgebung die du nutzt vorgenommen werden.
</p>

<ol type="a">
  <li>
    Download das passende Megabundle von den folgenden Links :
    <blockquote>
      <ul>
        <li>
          <a href="https://lg3d-core.dev.java.net/files/documents/1834/46210/lg3d--1-0-0-linux-i686-0612190943.bin">
            LG3D Release 1.0 Linux x86 Mega Bundle (19 December 2006) 
          </a>
        </li>
        <br />
        <li>
          <a href="https://lg3d-core.dev.java.net/files/documents/1834/46219/lg3d--1-0-0-solaris-i86pc-0612190950.bin">
            LG3D Release 1.0 Solaris x86 Mega Bundle (19 December 2006) 
          </a>
        </li>
      </ul>
    </blockquote>
  </li>
  <li>
    Suche das herunter geladene Mega-bundle *.bin file, z.B. 
    <span style="font-family: courier new,courier,monospace;">/tmp/lg3d-...-.bin</span>
  </li>
  <br />
  <li>
    Wechsle das aktuelle Verzeichnis in das, wohin du LG3D installieren m&ouml;chtest.
    <p>    
    <b>Linux Hinweis: Es ist wichtig das du LG3D in <tt>/usr/share</tt> auf deiner Maschine installierst.
    Du kannst es auch irgendwo anders hin installieren, nur dann wird deine gdm session kein LG3D starten können.</b>
  </li>
  <br />
  <li>
    Starte das Mega-bundle *.bin file, z.B.:
    <span style="font-family: courier new,courier,monospace;">
      sh /tmp/lg3d-...-.bin
    </span> <br><br>
    <b>Linux Hinweis: Wenn du dich entschieden hast deine Installation in <tt>/usr/share</tt> zu machen, dann must du das Kommando als root user ausf&uuml;hren.</b>
    <br />
    <p>
	Das Kommando erstellt ein Unterverzeichnis mit den Namen "<tt>lg3d</tt>" in dem aktuellen Verzeichnis und entpackt alles was du ben&ouml;tigst um LG3D laufen zu lassen (einschlie&szlig;lig JRE und Java 3D).
  </li>
  <br />
  <li>
    Der Installer zeigt die Lizensvereinbarungen.
    Lese es und dr&uuml;cke dann die "Leertaste" um zu scrollen, 
    danach beantworte die Frage mit einem "yes" oder "no".
  </li>
  <br />
  <li>
    Wenn du "yes" dr&uuml;ckst, f&auml;ngt der Installer an alles in das "<tt>lg3d</tt>" Unterverzeichnis zu entpacken.
    Wenn es fertig ist, steht "<tt>Done.</tt>", sobald alle Dateien entpackt sind.
  </li>
  <br />
  <li>
    F&uuml;ge LG3D als eine gdm Session hinzu (<b>nur Linux</b>):
  </li>
    <p>Auf Linux Maschinen kannst du festlegen, damit LG3D direkt vom gdm Desktop gestartet werden kann. In diesen Modus übernimmt LG3D den gesamten Schirm und läuft als das alleinige Fenster-Verwaltungsprogramm.
    <p>
    Um das einzustellen, wechsle zum user "root" und gebe folgende Kommandos ein:
    <p>
    <tt># cd /usr/share/lg3d/bin
    <br>	
    # ./postinstall</tt>
    <p>
    Hinweis: Du kannst das nur so ausf&uuml;hren, wenn du LG3D nach 
    <tt>/usr/share</tt> entpackt hattest.
  <br />
  <li>
  An dieser Stelle ist die Mega-bundle Installation bereits beendet.
  </li>
</ol>

</p>

<h4><a name="Debian"></a>2.2 Installieren der Debian .deb Pakete</h4> 
<p>
Die Debian Pakete wurden auf einem Ubuntu Dapper System gebaut und getestet,
sie sollten dennoch auf anderen Debian basierenden Systemen laufen.
</p>
Du kannst auf zwei Wegen die Debian Pakete herunterladen und installieren:
<ol type="a">
  <li>
    Downloade die drei .deb Dateien von
    <a href="https://lg3d-core.dev.java.net/binary-builds.html">
      der Bin&auml;r Pakete Seite</a> und installiere dann mit dem folgenden Kommando:
    <br><br>
    <tt>% sudo dpkg -i lg3d_jdk*.deb lg3d_java3d*.deb lg3d-core*.deb</tt>
    </p>
    <p>
    Hinweis: Die Installation der <tt>lg3d-core*.deb</tt> Pakete f&uuml;gt automatisch LG3D als eine Session im gdm Desktop 
    Session Wechsler hinzu. Es ist nicht n&ouml;tig irgend ein Script von Hand auszuf&uuml;hren.
  </li>
  <p> ODER </p>
  <a name="Synaptic_Install">
  <li>
    Installation durch Nutzung von <i>apt</i> oder dem <i>Synaptic Package Manager</i> (auf Ubuntu) indem folgendes gemacht wird (du must dich als <i>root</i> anmelden, mache das mit
    <tt>sudo bash</tt> als erstes) :
    <ul>
      <li>
	Da gibt es drei 3 LG3D repositories. Das <i>stable</i> repository besitzt die letzten stabilen
	Ver&ouml;ffentlichungen (0.8.1, 1.0 und so weiter). Das <i>testing</i>
	repository enth&auml;lt die pre-release Versionen (alpha, beta und so weiter) f&uuml;r die letzten Versionen und das <i>unstable</i> repsoitory enth&auml;lt die "nightly builds".
        Um diese Repositories zu benutzen, f&uuml;ge folgende Zeilen in
	<tt>/etc/apt/sources.list</tt> hinzu und kommentiere/unkommentiere die entsprechenden Zeilen.

        <pre>
  	## LG3D repsoitories
  	deb http://javadesktop.org/lg3d/debian stable contrib
  	# deb http://javadesktop.org/lg3d/debian testing contrib
  	# deb http://javadesktop.org/lg3d/debian unstable contrib
        </pre>
      </li>
      <li>
        Dann kannst Du
        <pre>
          % apt-get update
  	  % apt-get install lg3d-core
        </pre>
        ausf&uuml;hren ODER, auf Ubuntu Systemen, <br>
        <ul>
          <li>
      	    den <i>Synaptic Package Manager</i> im <i>System/Administration</i> Men&uuml; nutzen,
      	  </li>
      	  <li>
      	    click auf den <i>Relaod/Aktuallisieren</i> Button und dann auf 
      	  </li>
      	  <li>
      	    <i>Search/ Suchen</i> f&uuml;r <tt>lg3d</tt> und markiere das <tt>lg3d-core</tt> Paket f&uuml;r die Installation.
      	  </li>
      	  <li>
      	    click auf den <i>Apply/ &Uuml;bernehmen</i> Button zum downloaden und installieren
      	  </li>
	</ul>
      </li>
    </ul>
    <br/>
    Das ausw&auml;hlen von <tt>lg3d-core</tt> f&uuml;r die Installation sollte automatisch <tt>lg3d-jdk</tt> und <tt>lg3d-java3d</tt> f&uuml;r die Installation mit ausw&auml;hlen. Du must die drei Lizenzen besta&auml;tigen f&uuml;r lg3d, jdk und java3d um die Installation abzuschliessen.
  </li>
</ol>

<h3><a name="Running"></a>3. LG3D starten</h3> 
<img src="../images/lg_snapshot-s.png" width="200" vspace="8" hspace="8" style="float: right;"/>

<p>
  Es gibt die folgenden M&ouml;glichkeiten um LG3D laufen zu lassen:
</p>
<ol>
  <li><a name="RunningDevMode"><b>Developer mode (lg3d-dev)</b> :
    Dieser Modus ist auch bekannt als "<i>dev mode</i>".
    In diesem Modus, l&auml;ft LG3D in einem Fenster auf deinem Desktop. 
    Dies ist der einfachste Weg um LG3D laufen zu lassen aber der Modus erlaubt dir nur 
    Project Looking Glass 3D Anwendungen zu starten, so wie den CD viewer. 
    Native X11 Anwendungen, zum Beispiel xterm starten ausserhalb des LG Fensters; 
    sie erscheinen im X Fenster, von dem aus du LG3D gestartet hast. <br />
    Um im <i>dev mode</i> zu starten:
    <p/>
    <ol type=a>
      <li>
        Pr&uuml;fe ob OpenGL 1.3 oder neuer unterst&uuml;tzt wird:<br />
        <br />
        <span style="font-family: courier new,courier,monospace;">
          % glxinfo | grep "GLX version"<br />
          GLX version: 1.3<br />
        </span>
      <br />
        Wenn du einen Wert kleiner als 1.3 siehst, update deinen Graphiktreiber indem du
        der Beschreibung im
        <a href="#RequirementsGraphicsCard">Abschnitt f&uuml;r die Graffikkartenvorraussetzungen</a>.
        LG3D l&auml;ft mit OpenGL 1.2, aber 1.3 wird dringend empfohlen.
      </li>
      <br />
      <li>
          Wechsel das Verzeichnis in das LG3D Installationsverzeichnis.
      </li>
      <br />
      <li>
        Starte den <i>dev mode</i> durch Eingabe von:<br />
	<br />
	<span style="font-family: courier new,courier,monospace;">
	  % bin/lg3d-dev<br />
	</span>
      </li>
    </ol>
    <p>
	Wenn die LG3D Installation erfolgreich war, solltest du einen Startbildschirm
	und dann den LG3D Desktop in einem Fenster sehen.
	Wenn du auf das CD Icon in der Taskleiste klickst, &ouml;ffnet sich der CD Betrachter,
	eine 3D Demo Anwendung. Wenn du mit der Maus &uuml;ber den Stapel der CDs gehst und
	auf eines der CD Bilder klickst, siehst du die Anwendung in Aktion.

      F&uuml;r weiterf&uuml;hrende Informationen, siehe bitte auch 
      <a href="http://wiki.java.net/bin/view/Javadesktop/FirstRun"> 
	<b>das LG3D erster Start</b> Dokument
      </a>
      (bitte beachte das "X Apps Specific Features" ist nicht Verf&uuml;gbar im <i>dev mode</i>).
      Wenn du einige Dinge vermi&szlig;t, konsultiere den 
      <a href="#Troubleshooting">Problembehebungs</a> Abschnitt.
    </p>
  </li>
  <br />

  <li><a name="RunningAppMode"><b>Application Mode (lg3d-app)</b> :
    Dieser Modus ist auch bekannt als "<i>app mode</i>."
    In diesem Modus l&auml;uft LG3D auch in einem Fenster auf deinem Desktop aber er erlaubt
    den nativen X11 Anwedungen im gleichen Fenster wie LG3D zu laufen, so wie die LG3D
    Anwendungen. <br />
    Um LG3D in dem <i>app mode</i> zu starten:
    <p/>
    <ol type=a>
      <li>
        Pr&uuml;fe ob OpenGL 1.3 oder neuer unterst&uuml;tzt wird:<br />
        <br />
        <span style="font-family: courier new,courier,monospace;">
          % glxinfo | grep "GLX version"<br />
          GLX version: 1.3<br />
        </span>
        <br />
        Wenn du einen Wert kleiner als 1.3 siehst, update deinen Graphiktreiber indem du
        der Beschreibung im
        <a href="#RequirementsGraphicsCard">Abschnitt f&uuml;r die Graffikkartenvorraussetzungen</a>.
        LG3D l&auml;ft mit OpenGL 1.2, aber 1.3 wird dringend empfohlen.
      </li>
      <br />
      <li>
        Wechsel in das Verzeichnis in dem du LG3D installiert hast.
      </li>
      <br />
      <li>
        Starte den <i>app mode</i> durch Eingabe:<br />
        <br />
        <span style="font-family: courier new,courier,monospace;">
          % bin/lg3d-app<br />
        </span>
      </li>
    </ol>

    <p>
      Im Unterschied zum <i>dev mode</i>,  solltest du nun alle X Anwendungen innerhalb des LG3D Fensters
	starten k&ouml;nnen.  Teste 
      <tt>xterm</tt> durch klicken des Terminal Icon in der Taskleiste.
      Du solltest ein <tt>xterm</tt> aufgehen sehen, innerhalb der 3D Umgebung.

      Wenn du einige Dinge vermi&szlig;t, konsultiere den 
      <a href="#Troubleshooting">Problembehebungs</a> Abschnitt.
    </p>

    <p>
      Wenn du m&ouml;chtest, kannst du das LG3D Fenster als Vollbild starten 
      durch Nutzung der "<tt>-f</tt>" Option:
      <blockquote>
      <span style="font-family: courier new,courier,monospace;">
	% bin/lg3d-app -f
      </span>
      </blockquote>
      <p>
      In diesem Modus l&auml;ft lg3d-app unter dem GNOME Fenstermanager,
      so das du Zugriff zu der GNOME Taskbar und zu den Anwengungen hast die enthalten sind,
	aber das LG3D Fenster belegt den gesamten Bildschirm. 
	Du hast keine M&ouml;glichkeit die Gr&ouml;&szlig;e zu ver&auml;ndern.
      <p>
      Wenn du das LG3D Fenster weiter configurieren m&ouml;chtest, siehe auch das 
      <a href="lg3d-window-resizing.html">
	Resizing and Configuring LG3D Window Dokument
      </a>.  
    </p>

    <p>
    <b>Linux Hinweis</b>: wenn du LG3D in <tt>/usr/share/lg3d</tt> installiert hast und und dann
	<tt>postinstall</tt> hast laufen lassen w&auml;hrend der Installation , 
	dann hast du eine andere M&ouml;glichkeit den app mode zu starten. 
	In dieser Einstellung wurde LG3D als eine andere Desktop Session 
	in dem gdm Desktop Session Wechsler eigetragen. 
	Wenn das System neu startet und der Session Wechsler zur Verf&uuml;gung steht,
	klicke auf "Session" und dann klick in dem Men&uuml; auf "Looking Glass". 
	In diesem Modus starte Gnome nicht mit, und LG3D ist der alleinige Fenstermanager.
    </p>

  </li>
</ol>

<p>
  Entdecke den Looking Glass Desktop und beginne mit den Tr&auml;men bon neuen
  Wegen den Desktop in 3D zu nutzen! Wenn du bereit bist zum Entwickeln, 
  schaue &uuml;ber die <a href="lg3d-developers-guide.html">Project
  Looking Glass Developer's Guide</a> Seite f&uuml;r Informationen &uuml;ber das entwickeln mit
  dem Project Looking Glass.
</p>

<h3><a name="Resources"></a>4. N&uuml;tzliche Links</h3> 

<p>
  Hier ist eine Liste von Quellen die auch noch interessant sind ...
</p>
<ul>
  <li>
    <a href="http://wiki.java.net/bin/view/Javadesktop/FirstRun"> 
      LG3D's Erster Start
    </a>
  </li>
  <li>
    <a href="http://forums.java.net/jive/forum.jspa?forumID=80">
      LG3D Diskussions Forum
    </a>
  </li>
  <a href="release-notes.html">
    Project Looking Glass Entwickler Release Notes
  </a>
  <li>
    <a href="index.html#Reporting_Issues">
      Berichte &uuml;ber Ausgaben
    </a>
  </li>
  <li>
    <a href="index.html#Staying_Connected">
      In Verbindung bleiben
    </a>
  </li>
  <li>
    <a href="index.html#How_to_Contribute">
      Wie kann ich unterst&uuml;tzen
    </a>
  </li>
  <li>
    <a href="index.html#Sub-projects">
      Andere Unterprojekte
    </a>
  </li>
  <li>
    <a href="lg3d-on-windows.html">
      Das Project Looking Glass Entwickler Release unter Microsoft Windows laufen lassen
    </a>
  </li>
  <li>
    <a href="lg3d-developers-guide.html">
      Project Looking Glass Entwicklerhandbuch
    </a>
  </li>
  <li>
    <a href="tutorial/index.html">
      Project Looking Glass Tutorials
    </a>
  </li>
  <li>
    <a href="https://lg3d-core.dev.java.net/files/documents/1834/30923/LG3D-Overview.pdf">
      Project Looking Glass - A Comprehensive Overview of the Technology (PDF 1.6MB)
    </a>
  </li>
  <li>
    <a href="index.html#Resources">
      Andere Quellen
    </a>
  </li>
</ul>

<h3><a name="FinalWords"></a>5. Einige Abschlussworte ...</h3>
<p>
  Danke f&uuml;r das Project Looking Glass!
  Wir warten auf deine Beiträge in dieser aufregenden neuen Desktop Erfahrung!
</p>
<br />


<br />
<hr /><!-- --------------------------------------------------------- -->
<br />

<h3><a name="ColorDepth"></a>APPENDIX A: Color Depth Configuration</h3>

<blockquote>
<h4>Java Desktop System 1 and 2, and SUSE8.1:</h4>

<ol>
  <li>From within a desktop session, run the sax2 command:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
% /usr/X11R6/bin/sax2<br />
SaX: root Password:</span> <b>enter root password</b><br />
    <br />
  </li>
  <li>In the SaX2 application, click on <b>Color and Resolution</b> then click the <b>[Properties...]</b> button for the
currently configured desktop.</li>
  <li>In the <b>Color selection...</b>
panel, click on the the menu and choose <b>16.7 Mio. [24 Bit]</b>. <br />
  </li>
  <li>On the <b>Resolution(s) for 16.7
Mio. [24 Bit] colors</b> tab, select the preferred resolution for
your desktop and press <b>[Ok]</b>.<br />
  </li>
  <li>Click the <b>[Finish]</b>
button, then <b>[Finalize&gt;&gt;]</b>.<br />
  </li>
  <li>The <b>SaX2 final steps...</b>
dialog will open. Click the <b>[Test...]</b>
button to test the new resolution. <br />
  </li>
  <li>A blue test screen should appear, click the <b>[Save]</b> button if the display appears
to be stable, and then <b>[Ok]</b>
when you return to the SaX2 window, followed by <b>[Yes]</b> to exit from SaX2.</li>
  <li>If the test screen did not appear correctly, the test will exit
after 30 seconds and your previous desktop session will be restored.
You should then try alternate resolutions at the 24 bit color depth to
find a resolution that works for your system.<br />
  </li>
  <li>When you are satisfied with the settings, log out and re-login to
your desktop session and verify that the color depth is now 24 bit or
higher using the <span style="font-family: courier new,courier,monospace;">xdpyinfo</span>
command above.</li>
</ol>

<h4>RedHat Fedora 2:</h4>

<ol>
  <li>First become root:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
% su root<br />
Password:</span> <b>enter root password</b> <br />
<span style="font-family: courier new,courier,monospace;">#</span><br />
    <br />
  </li>
  <li>Edit the file: <span style="font-family: courier new,courier,monospace;">/etc/X11/xorg.conf</span></li>
  <li>Locate the section of the file labeled: <span
 style="font-family: courier new,courier,monospace;">Section "Screen"</span><span
 style="font-family: courier new,courier,monospace;"><br />
    </span></li>
  <li>Within this section, locate the entry: <span
 style="font-family: courier new,courier,monospace;">Identifier "Screen0"<br />
    </span>Change the <span style="font-family: courier new,courier,monospace;">DefaultDepth</span>
and <span style="font-family: courier new,courier,monospace;">DefaultFbBpp </span>properties
to:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">DefaultDepth 24<br />
DefaultFbBpp 32<br />
    <br />
    </span></li>
  <li>Save the file and then logout and re-login to your desktop
session and verify that the color depth is now 24 bit or higher using
the <span style="font-family: courier new,courier,monospace;">xdpyinfo</span>
command above.<br />
  </li>
</ol>

<h4>RedHat 8, RedHat 9 and other Linux distributions:</h4>

<p>
Many Linux platforms use the <span
 style="font-family: courier new,courier,monospace;">XF86Config</span> file to
configure the display properties. To change the color depth on these
systems:
</p>

<ol>
  <li>First become root:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
% su root<br />
Password:</span> <b>enter root password</b> <br />
<span style="font-family: courier new,courier,monospace;">#</span><br />
    <br />
  </li>
  <li>Edit the file: <span style="font-family: courier new,courier,monospace;">/etc/X11/XF86Config</span></li>
  <li>Locate the section of the file labeled: <span
 style="font-family: courier new,courier,monospace;">Section "Screen"</span> and
change the <span style="font-family: courier new,courier,monospace;">DefaultDepth</span>
property to
24:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">DefaultDepth&nbsp;&nbsp;&nbsp;&nbsp;
24<br />
    <br />
    </span></li>
  <li>Within this section, locate the sub-section labeled <span
 style="font-family: courier new,courier,monospace;">"Display":<br />
    <br />
    </span><span style="font-family: courier new,courier,monospace;">SubSection
"Display"<br />
    <br />
    </span>and change the <span style="font-family: courier new,courier,monospace;">Depth</span>
property to:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">Depth&nbsp;&nbsp;&nbsp;&nbsp;
24<br />
    <br />
    </span></li>
  <li>Save the file and then logout and re-login to your desktop
session and verify that the color depth is now 24 bit or higher using
the <span style="font-family: courier new,courier,monospace;">xdpyinfo</span>
command above.</li>
</ol>

<h4>Solaris x86 :</h4>

<p>
Solaris x86 uses the <span
 style="font-family: courier new,courier,monospace;">xorg.conf</span> file to
configure the display properties for the Xorg server which is used by Project Looking Glass. To change the color depth on Solaris x86:
</p>

<ol>
  <li>First become root:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
% su root<br />
Password:</span> <b>enter root password</b> <br />
<span style="font-family: courier new,courier,monospace;">#</span><br />
    <br />
  </li>
  <li>Edit the file: <span style="font-family: courier new,courier,monospace;">/etc/X11/xorg.conf</span></li>
  <li>Locate the section of the file labeled: <span
 style="font-family: courier new,courier,monospace;">Section "Screen"</span> and
change the <span style="font-family: courier new,courier,monospace;">DefaultDepth</span>
property to
24:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">DefaultDepth&nbsp;&nbsp;&nbsp;&nbsp;
24<br />
    <br />
    </span></li>
  <li>Save the file and then logout and re-login to your desktop
session and verify that the color depth is now 24 bit or higher using
the <span style="font-family: courier new,courier,monospace;">xdpyinfo</span>
command above.</li>
</ol>
</blockquote>

<br />
<hr /><!-- --------------------------------------------------------- -->
<br />

<h3><a name="BringingDownX"></a>APPENDIX B: Bringing Down X Session</h3>

<p>
  The instructions for shutting down your X session vary by platform, 
  so follow the instructions that apply to your platform. 
  If your platform isn't listed, chances are the process will be very similar.
  So, use these instructions as a guide and let us know what's different!
</p>

<blockquote>
<h4>Sun Java Desktop System/SuSE 8.1:</h4>

<p>
JDS/SuSE 8.1 uses the X Display Manager (xdm) to manage user sessions.
To run Project Looking Glass you must first shut down xdm. Since this
process is respawned automatically you must disable this service using
the <span style="font-family: courier new,courier,monospace;">chkconfig</span>
command:
</p>

<ol>
  <li>First become root:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
% su root<br />
Password:</span> <b>enter root password</b> <br />
<span style="font-family: courier new,courier,monospace;">#</span><br />
    <br />
  </li>
  <li>Disable the xdm service:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
# /sbin/chkconfig -d xdm<br />
xdm&nbsp; 0:off&nbsp;&nbsp; 1:off&nbsp;&nbsp; 2:off&nbsp;&nbsp;
3:off&nbsp;&nbsp; 4:off&nbsp;&nbsp; 5:off&nbsp;&nbsp; 6:off<br />
    <br />
    </span></li>
  <li>Now close any desktop applications and save any open files. Then
shutdown the display manager:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;"> # pkill gdm-binary<br />
    <br />
    </span></li>
  <li>Now skip to the <a href="#Starting_the_Project_Looking_Glass">Starting
the Project Looking Glass desktop session</a> section.</li>
</ol>
<p>
<b>Note:</b> To re-activate the X
Display manager, enter the following command as root, and then reboot
your system:
</p>
<blockquote><span
 style="font-family: courier new,courier,monospace;"># /sbin/chkconfig -a xdm</span><br />
</blockquote>

<h4>RedHat 9:</h4>
<p>
RedHat uses the GNOME Display Manager (gdm) to manage user sessions.
It's not necessary to disable gdm, you can simply switch to a lower run
level where gdm is not active:
</p>

<ol>
  <li>First become root:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
% su root<br />
Password:</span> <b>enter root password</b><br />
<span style="font-family: courier new,courier,monospace;">#</span><br />
    <br />
    </li>
  <li>Close any desktop applications and save any open files. Then
switch to run level 4:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;"> # /sbin/init 4<br />
    <br />
    </span>Your X session should terminate and your should return to
the console prompt.<br />
    <br />
  </li>
  <li>Now skip to the <a href="#Starting_the_Project_Looking_Glass">Starting
the Project Looking Glass desktop session</a> section.</li>
</ol>
<p>
<b>Note:</b> To restart the GNOME
Display Manager, enter the following command as root from the console:
</p>
<blockquote><span
 style="font-family: courier new,courier,monospace;"># /sbin/init 5</span><br />
</blockquote>

<h4>Fedora Core 3 64-bit:</h4>

<p>
To run Project Looking Glass full screen on the 64-bit version of
Fedora Core 3 requires a few unique changes. Note that you will need
access to a 32-bit Linux system or the 32-bit X11 modules for Linux to
complete this procedure.
</p>

<ol>
  <li>You will need to copy the contents of the <span
 style="font-family: courier new,courier,monospace;">/usr/X11R6/lib/modules</span>
directory from a 32-bit Linux system to the same directory on your
64-bit system. Before performing this action, make a backup of the <span
 style="font-family: courier new,courier,monospace;">/usr/X11R6/lib/modules</span>
directory on your 64-bit system:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
# cd /usr/X11R6/lib<br />
# cp -r modules modules.orig<br />
    </span><br />
Next, use the scp command to securely copy the files from the 32-bit
system to your 64-bit system:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
# scp -r root@<span style="font-style: italic;">32bithost</span>:/usr/X11R6/lib/modules
/usr/X11R6/lib/modules<br />
    </span><br />
where <span
 style="font-style: italic; font-family: courier new,courier,monospace;">32bithost</span><span
 style="font-family: courier new,courier,monospace;"> </span>is the
host name of the 32-bit Linux system.<br />
    <br />
  </li>
  <li>Make sure that your <span
 style="font-family: courier new,courier,monospace;">xorg.conf</span>
file is set for depth of 24 as
shown in bold below:<br />
    <br />
    <span style="font-family: courier new,courier,monospace;">
Section "Screen"<br />
Identifier "Screen0"<br />
Device "Videocard0"<br />
Monitor "Monitor0"<br />
<b>DefaultDepth 24</b><br />
SubSection "Display"<br />
Viewport 0 0<br />
<b>Depth 24</b><br />
Modes "1680x1050" "1280x800" "1024x768" "800x600" "640x480"<br />
EndSubSection<br />
EndSection<br />
    <br />
</span>
  </li>
  <li>Proceed to the next section to start the full screen session.<br />
    <br />
[Instructions in this section courtesy of <a
 href="http://www.javadesktop.org/forums/profile.jspa?userID=1354">qgonjon</a>
and <a
 href="http://www.javadesktop.org/forums/profile.jspa?userID=1522">marve</a>.
See <a
 href="http://www.javadesktop.org/forums/thread.jspa?forumID=56&amp;threadID=3465&amp;messageID=17942#17942">this
support thread</a>.]<br />
  </li>
</ol>

<h4>Solaris x86:</h4>
<p>
In order to run Project Looking Glass in session mode on Solaris x86, you
must first shut down CDE and disable its subsequent boot-time start up.
To do this, become root and type:
<br><br>
<span style="font-family: courier new,courier,monospace;">
# /usr/dt/bin/dtconfig -d
</span>
<br><br>
then reboot your computer.
</p>
</blockquote>

<br />
<hr /><!-- --------------------------------------------------------- -->
<br />

<h3><a name="Troubleshooting"></a>APPENDIX C: Troubleshooting</h3>

<blockquote>

  <h4> Screen updates are very slow</h4>
  
<p>This usually means that graphics
acceleration is not correctly configured, or the graphics card is
not capable enough to run LG3D. 
Here are some things to check first:</p>
<ul>
  <li>Run the <span style="font-family: courier new,courier,monospace;">glxinfo</span>
command from within an X11 session and check that the 
<b>direct rendering</b> property is set to 
<b>Yes</b>. Also look for references to 
<b>OpenGL</b> to ensure that your graphics
accelerator device driver supports OpenGL.<br />
- For NVIDIA cards, run <span style="font-family: courier new,courier,monospace;">xdpyinfo</span>
and verify that you see GLX or NVIDIA-GLX.<br />
    <br />
If you don't see these properties then you probably don't have the
appropriate device driver installed or 3D enabled. Refer to your
vendor's web site for information on installing and configuring a
device driver with 3D/OpenGL support.<br />
    <br />
  </li>
  <li>Check the X server log file at <span
 style="font-family: courier new,courier,monospace;">/var/log/Xorg.0.log</span>
for error messages and to check which drivers are being loaded.<br />
  </li>
</ul>
Even if it turned out that the graphics card is less capable, you
may be able to run LG3D with 16bit color.  
Please refere to the
<a href="#ColorDepth">Color Depth Configuration instructions</a>.
Note that <i>the session mode</i> in 16bit color is not fully supported,
and you may encounter rendering and other issues.

  <h4>Fatal Server error: Cannot establish any listening sockets</h4>
  
<p>The following error message is
displayed when
you start Project Looking Glass using lg3d-session:
</p>
<blockquote><span
 style="font-family: courier new,courier,monospace;">
_XSERVTransSocketUNIXCreateListener: ...SocketCreateListener() failed<br />
_XSERVTransMakeAllCOTSServerListeners: server already running<br /><br />
Fatal server error:<br />
Cannot establish any listening sockets - Make sure an X server<br />isn't already running</span></blockquote>
<p>
First, make sure that you do not have an X11 session 
(or an lg3d-app window) running on the display on which you're starting <span
 style="font-family: courier new,courier,monospace;">lg3d-session</span>. Then check
to see if you have <span style="font-family: courier new,courier,monospace;">/tmp/.X11-unix/X0
(or <span style="font-family: courier new,courier,monospace;">X1</span> 
for lg3d-app)</span> left behind from a previous session. To fix this problem, delete
this file and restart <span style="font-family: courier new,courier,monospace;">lg3d-session</span>
(or <span style="font-family: courier new,courier,monospace;">lg3d-app</span>).
</p>

  <h4>SEVERE: Unable to listen on Socket 44816. Make sure to terminate all the other LG3D processes.</h4>

<p>
  You can get this even if you are sure there is no other LG3D process running.
  It typically happens when the previous LG3D session was terminated in an
  abnormal manner.  Do the following and kill all the Java processes.  
  Be careful to close the other running Java apps like NetBeans and Eclipse 
  before performing this:
</p>
<blockquote>
  <span style="font-family: courier new,courier,monospace;">% pkill -9 java</span> 
</blockquote>

  <h4>An unexpected exception has been detected in native code outside the VM</h4>

<p>
Project Looking Glass exits with the
following exception, even though you've verified that you have 3D
acceleration enabled:
</p>
<blockquote><span
 style="font-family: courier new,courier,monospace;">An unexpected exception has
been detected
in native code outside the VM.<br />
Unexpected Signal : 11 occurred at PC=0x0<br />
Function=[Unknown.]<br />
Library=(N/A)</span><br />
</blockquote>
  <p>Check to see if the following entries appear in the exception
message:
  </p>
<blockquote>
<span
 style="font-family: courier new,courier,monospace;">&lt;addr-range&gt; r-xp
00000000 03:05
61763 /usr/lib/GL/libGL.so.1.3.mesasoft<br />
&lt;addr-range&gt; rw-p 001b4000 03:05 61763
/usr/lib/GL/libGL.so.1.3.mesasoft</span>
</blockquote>

  <p> If so, you have the MESA software OpenGL libraries installed. Use
the package tool for your distribution (e.g., rpm) to remove these
libraries, and then go into <span
 style="font-family: courier new,courier,monospace;">/usr/lib</span> as root and
check that the following symbolic links exist and point to the correct
OpenGL libraries. You should have links that look something like this
(where x and y are numbers):<br />
  </p>
  <blockquote><span
 style="font-family: courier new,courier,monospace;">
libGLcore.so.1 -&gt; libGLcore.so.1.x<br />
libGL.so -&gt; libGL.so.x<br />
libGLU.so -&gt; libGLU.so.x.y.z<br /></span></blockquote>
<p>
If these links are not correct, become root and create them. For
example, if you have a<span style="font-family: courier new,courier,monospace;">
libGLU.so.1</span> file but no <span
 style="font-family: courier new,courier,monospace;">libGLU.so</span> link, then
create the link:
</p>
  <blockquote><span
 style="font-family: courier new,courier,monospace;"># ln -s /usr/lib/libGLU.so.1 /usr/lib/libGLU.so</span><br /></blockquote>

<p>
Repeat this for each of the links that are missing.
</p>

  <h4>Fatal server error: could not open default font 'fixed'</h4>
  
<p>
  In some Linux distro, the <tt>/usr/X11R6/lib/X11/fonts</tt> direcotry
  doesn't exist, or it doesn't include font files that LG3D's X server 
  expects.  Do the followings and see if it fixes the issue:
</p>
<blockquote><span style="font-family: courier new,courier,monospace;">
% sudo mv /usr/X11R6/lib/X11/fonts /usr/X11R6/lib/X11/fonts.orig<br />
% sudo ln -s /usr/share/X11/fonts /usr/X11R6/lib/X11/fonts
</span></blockquote>

  <h4>libGL error: failed to open DRM: operation not permitted</h4>
  
<p>
(This error may be encountered when running lg3d-dev).
</p>
<p>
If Project Looking Glass runs very slowly, even though 3D
acceleration is enabled, check to see if the following message appears
in the console:
</p>
<blockquote><span style="font-family: courier new,courier,monospace;">
libGL error: failed to open DRM: Operation not permitted<br />
libGL error: reverting to (slow) indirect rendering
</span></blockquote>

  <p> This means that your user account doesn't have permission to use
the DRI (Direct Rendering Infrastructure). In some cases root is the
only user with access to Direct Rendering. This problem seems to only
affect RedHat users, and not JDS/SuSE users. If you have this problem,
you should change the DRI permissions in your xorg.conf or
XF86Config file to:</p>

<blockquote> <span
 style="font-family: courier new,courier,monospace;">Section "DRI"<br />
Group "video"<br />
Mode 0666<br />
EndSection</span><br />
</blockquote>

  <p> You will also need to change the permissions of the <span
 style="font-family: courier new,courier,monospace;">&lt;dri&gt;</span> profile in<span
 style="font-family: courier new,courier,monospace;"> /etc/security/console.perms</span>
from 0600 to 0666:<br />
  </p>
  <blockquote><span
 style="font-family: courier new,courier,monospace;">&lt;xconsole&gt; 0600
&lt;dri&gt; 0666 root</span></blockquote>
  <p>and if you're using an NVIDIA card, change the permissions on <span
 style="font-family: courier new,courier,monospace;">/dev/nvidia*</span> to 0666:<br />
  </p>
  <blockquote><span
 style="font-family: courier new,courier,monospace;"># chmod a+rw /dev/nvidia*</span></blockquote>

  <h4> Failed to load the NVIDIA driver</h4>

  <p>There are several possible reasons for the driver failing to
initialize correctly:<br />
  </p>
  <ul>
    <li>The NVIDIA driver is compiled for linux.*bigmem. If your Linux
system has two images, bigmem and linux*up, use the former one.
Otherwise the driver will fail to load.<br />
      <br />
    </li>
    <li>The NVIDIA driver needs to find the IRQ that is assigned to the
video card. This should be set by the BIOS before the OS boots, but it
can be switched off in some BIOS. Try switching it back on again to see
if it helps.<br />
      <br />
    </li>
    <li>Refer to the NVIDIA driver installation instructions and
release notes for further details.</li>
  </ul>
  
  <h4>no core pointer</h4>
  
<p>
This happens on RedHat Fedora Core 2,
and
may happen on other configurations as well. One known workaround (from
sgiunchi) is to do the following (as root
user):
</p>
<blockquote><span
 style="font-family: courier new,courier,monospace;"># ln -s
/etc/X11/xorg.conf /etc/X11/XF86Config-4</span><br />
</blockquote>
<p>
The correct long term fix is to upgrade the X11 release which is
included
in lg3d-core. It is currently an Xorg 6.7 pre-release and it needs to
be
upgraded to the latest Xorg stable release. 
</p>

<h4>Exception in thread "main" java.lang.UnsatisfiedLinkError:
/usr/java/jdk1.5.0/jre/lib/i386/libj3dcore-ogl.so:<br />
/usr/java/jdk1.5.0/jre/lib/i386/libj3dcore-ogl.so:
symbol glMultiDrawArraysEXT, version LIBGL not defined in file
libGL.so.1 with link time reference</h4>
<p>
This error occurs with ATI device
drivers
that are missing the glMultiDrawArraysEXT extension. The solution to
this
problem is to replace the Radeon device drivers with drivers from the <a
 href="http://dri.sourceforge.net/cgi-bin/moin.cgi/FrontPage">Direct
Rendering
Open Source</a> (DRI) project. For instructions on installing direct
rendering
drivers refer to <a href="dri-driver-install-ati-radeon.html">DRI
driver
installation for ATI Radeon</a>.
</p>
<p>
Note that upgrading libGL.so to the latest Mesa libraries does not
solve
this problem.
</p>

  <h4>pkill: 27863 - Operation not permitted<br />
  
java.rmi.server.ExportException: Port already in use: 1099; nested
exception
is: <br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; java.net.BindException: Address already
in
use...<br />
  </h4>

<p>This message indicates that an <span
 style="font-family: courier new,courier,monospace;">rmiregistry </span>process is
already
running and <span style="font-family: courier new,courier,monospace;">lg3d-dev</span>
was
unable to start a new instance. Typically this occurs when the <span
 style="font-family: courier new,courier,monospace;">rmiregistry</span> process was
started
by root and <span style="font-family: courier new,courier,monospace;">lg3d-dev</span>
is
run as a non-root user. The solution to this problem is to stop the
root
instance of <span style="font-family: courier new,courier,monospace;">rmiregistry</span>.
Become root and stop the
process:
</p>
<blockquote>
<span
 style="font-family: courier new,courier,monospace;">
 % su root<br />
 Password: <b>enter root password</b> <br />
 # pkill rmiregistry<br />
 # exit</span><br />
</blockquote>
<p>
Now re-run the <span style="font-family: courier new,courier,monospace;">lg3d-dev</span>
command as a non-root user to start Project Looking Glass.
</p>
</blockquote>

<p>
  <b>See also:</b>
  <a href="release-notes.html">Project Looking Glass Developer's
    Release Notes
  </a>
</p>
<p>
  Additional information on current problems and issues can be found
  under lg3d-core<b> Project Tools </b>-&gt; <b>Issue tracker</b>. 
  You can search for issues and defects or find a specific issue.
</p>

<br />
<hr /><!-- --------------------------------------------------------- -->
<br /> 

<small> $Revision: 1.5 $ $Date: 2007-01-05 12:04:43 $ </small>
</div>
</body>
</html>
