<!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//EN"
"http://style.tigris.org/tigris_transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
	<head>
		<title>LG3D Core Project Contributor Spotlight</title>
		<meta name="Translator" content="Christian Ost (cost)" />
		<style type="text/css"> /* <![CDATA[ */
@import "preview.css";
/* ]]> */</style>
	</head>
	<body>
		<div class="app" id="projectdocumentview">
			<h2>Contributor Spotlight <small>und Projektleiter</small></h2>
			<center>
				<table style="width: 100%; text-align: left;" border="1" cellpadding="4" cellspacing="4">
					<tbody>
						<tr>
						<td>
							<img vspace="4" hspace="4" alt="Kirk Turner" style="border: 0px solid ; float: left; width: 100px;" src="../images/contributors/gameldar.jpg" />
						</td>
						<td bgcolor="#ffffe4">
							<p>
								<b>Kirk Turner (gameldar)</b>
							</p>
							<p>
								" Seit ich die Uni verlassen habe (mit einem doppelten Abschluss in Biologie und Informatik), 
								arbeite ich f&uuml;r eine kleine Softwareentwicklungsfirma, WA Go Online (<a href="http://www.wagoonline.com">www.wagoonline.com</a>), 
								als Entwickler, (werdender?) Systemadministrator und in letzter Zeit habe
								ich v.a. Sicherheitsbertungen durchge&uuml;hrt. Ich bin ein gro&szlig;er Unterst&uuml;tzer
								von FOSS und wollte auch etwas an die Community zur&uuml;ckgeben, 
								also nahm ich die Chance wahr bei der Entwicklung von LG3D - etwas, dass dessen
								Konzept und Zukunft ich mag und wo ich meine Java-Kenntnisse einbringen kann - zu helfen. 
								So verbringe ich au&szlig;er meinen T&auml;tigkeiten als Ehemann und Hundebesitzer
								einige Zeit durch Arbeit an dem Projekt, wie auch immer ich dies kann."
							</p>
							<p>
								    Viele von euch werden Kirks Name von seinem exzellenten LG3D Tutorial her kennen.
								    Oder, vielleicht von dem herausfordernden 3D Swing Look &amp; Feel Projekt. 
								    Er war der allererste, der seinen JCA geschickt hat und seine Beitr&auml;ge 
								    seit damals sind von unsch&auml;tzbaren Wert. Vielen, vielen Dank, Kirk!
							</p>							
						</td>
					</tr>
					<tr>
							<td>
								<img vspace="4" hspace="4" alt="David Weizades" style="border: 0px solid ; float: left; width: 100px;" src="../images/contributors/ddew.jpg" />
							</td>							
							<td bgcolor="#ffffe4">
								<p>
									<b>David Weizades (ddew)</b>
								</p>
								<p>" Nun gut, was soll ich sagen. 'Bin allgemein ein Computergeek und spiele geren 
									an verschiedenen Betriebssystemen rum. Ich habe nicht ann&auml;hernd so viel 
									wie Amir zum Projekt beigetragen. Aber ich denke gerne von mir, dass ich Ideen 
									liefere und sehr ordentliches Bugtesting mache. Im Moment binn ich 
									zur&uuml;ckgetretener Student, aber ich hoffe in Zukunft meine Studien entweder 
									am Chalmers oder MIT beginnen zu k&ouml;nnen. Au&szlig;erdem trinke ich gerne 
									und repariere Autos von Porsche."<br />
								</p>
								<p>
									Seit den allerersten Tagen war David einer der aktivesten Entwickler und hat 
									das Projekt auf verschiedenste Weise, wie z.B. schnelle Antworten auf 
									Installationsprobleme, Testreleases und das Leiten und der wesentliche Beitrag 
									zu kreativen Diskussionen, unterst&uuml;tzt. Vielen Dank, David!
								</p>
							</td>
						</tr>
						<tr>
							<td>
								<img vspace="4" hspace="4" alt="Amir Bukhari" style="border: 0px solid ; float: left; width: 100px;" src="../images/contributors/amirsadig.jpg" />
							</td>
							<td bgcolor="#ffffe4">
								<p>
									<b>Amir Bukhari (amirsadig)</b>
								</p>
								<p>
									" Ich studiere im Moment Elektrotechnik (auf Master) an der Universit&auml;t 
									Karlsruhe . Mein Lieblingshobby ist Programmieren (C/C++ &amp; Java). 
									Zus&auml;tzlich zum Studium arbeite ich als Programmierer am FZI (Research 
									Center for Information Technologies) <a href="http://www.fzi.de">http://www.fzi.de</a>. 
									Ich habe am FZI viel Erfahrunge in der Programmierung von Mikrocontrollern mit 
									Java sammeln k&ouml;nnen."<br />
								</p>
								<p>
									Er verbrachte sehr viele Stunden mit dem Debuggen und Reparieren von Problemen 
									im Bereich X Anwendungen und seine Beitr&auml;ge waren in Hinsicht des 
									Erreichens der Ziele des 0.61 Releases von unsch&auml;tzbarem Wert. Vielen 
									Dank, Amir!
								</p>
							</td>
						</tr>
						<tr>
      							<td>
      								<img vspace="8" hspace="8"
									alt="Phil Dowell"
									style="border: 0px solid ; float: left; width: 100px;"
									src="../images/contributors/phild.jpg" />
      							</td>
      							<td bgcolor="#ffffe4">
     								 <p>
        								<b>Phil Dowell (phild)</b>
      								</p>
      								<p>
        								" Im Moment arbeite ich bei Sun als FA / debug engineer in meiner Heimatstadt
        								Linlithgow in Schottland. Obwohl ich ein ziemlich guter Truck-Mechaniker bin, bin ich A+
									und Network+ zertifiziert, allerdings mit keiner anderen Programmiererfahrung, als einem
									bisschen Java von einem halbgelesenen Buch. Meine anderen Hobbies/Leidenschaften sind meine
									Familie, Graphikdesign und Formel 1 Motorrennen. Ich beschäftige mich nun fast zwei Jahre 
									mit Linux und Project Looking Glass, von der frühen Konzeptdemo, über jz-core, bis dahin
									wo wir uns heute befinden. (Und es war den ganzen Weg über ein Vergnügen) 
      								</p>
      								<p>
      									  Als Sun Angestellter war Phil ein sehr früher Entwickler und hat zu LG3D schon beigetragen,
									  bevor es überhaupt offiziell ein Projekt war. Seine neuseten Beiträge beinhalten den Splashscreen
									  und er hilft immer gerne, indem er im Forum Fragen beantwortet.
								</p>
    </tr>
						<tr>
							<td>
								<img vspace="4" hspace="4" alt="Deron Johnson" style="border: 0px solid ; float: left; width: 100px;" src="../images/contributors/deronj.jpg" />
							</td>
							<td bgcolor="#ffffe4">
								<p>
									<b>Deron Johnson (deronj)</b>
								</p>
								<p>
									" Ich bin nun schon 17 Jahre bei Sun und arbeitete an einer Vielzahl von 
									Fenstersystemen und 3D-Grafik Projekten, u.a. an der DRI Funktionalit&auml;t in 
									X11, der Portierung von X11 auf verschiedene Sun Grafikkarten, OpenGL 
									Grafiktreibern und GPU-Kontrollsoftware. Bei der Arbeit an Projekt Looking 
									Glass genie&szlig;e ich es diese zwei Bereiche in einem Projekt kombinieren zu 
									k&ouml;nnen. Ich bin f&uuml;r die X11-Integration und Verbesserungen an der 
									Grafikarchitektur verantwortlich."
								</p>
							</td>
						</tr>
						<tr>
							<td>
								<img vspace="4" hspace="4" alt="Hideya Kawahara" style="border: 0px solid ; float: left; width: 100px;" src="../images/contributors/hideya.jpg" />
							</td>
							<td bgcolor="#ffffe4">
								<p>
									<b>Hideya Kawahara (hideya)</b>
								</p>
								<p>
									" Mein Hintergrund besteht haupts&auml;chlich aus Themen rund um Java und J2ME, 
									einer Java Umgebung f&uuml;r (mobile) Endger&auml;te. Ich startete in meiner 
									Freizeit die Entwicklung eines Prototyps f&uuml;r eine 3D Desktop-Umgebung, die 
									die konzeptionelle Basis f&uuml;r LG3D wurde.In diesem Projekt arbeite ich im 
									Wesentlichen am SceneManager, der Client API und visuellen/UI Problemen. Ich 
									liebe cool aussehende Dinge. Ich bin so froh, dass diese Projekt f&uuml;r die 
									Community ge&ouml;ffnet wurde und dass ich die Chance habe mit Euch diese neuen 
									M&ouml;glichkeiten zu erforschen."
								</p>
							</td>
						</tr>
						<tr>
							<td>
								<img vspace="4" hspace="4" alt="Paul Byrne" style="border: 0px solid ; float: left; width: 100px;" src="../images/contributors/paulby.jpg" />
							</td>
							<td bgcolor="#ffffe4">
								<p>
									<b>Paul Byrne (paulby)</b>
								</p>
								<p>
									" Ich bin seit &uuml;ber 10 Jahren bei Sun, in denen ich extensiv mit Java und 
									Java3D besch&auml;ftigt habe, z.B. als Autor von SceneGraphIO, J3dEditor und 
									J3dFly. Nun bin ich Projektleiter f&uuml;r die Kern-PLG-Plattform. Mein Ziel 
									dabei ist eine m&auml;chtige Plattform f&uuml;r den 3D Desktop der 
									n&auml;chsten Generation zu schaffen, mit speziellem Gewicht auf 
									Entwicklungswerkzeugen, sowohl f&uuml;r Software, als auch Inhaltsentwickler."
								</p>
							</td>
						</tr>
					</tbody>
				</table>
			</center>
			<hr />
			<small>$Revision: 1.1 $ $Date: 2006-05-09 17:46:20 $ (Englsh Version Revision: 1.9)</small>
		</div>
	</body>
</html>
