 <!DOCTYPE html PUBLIC "-//Tigris//DTD XHTML 1.0 Transitional//ES"
"http://style.tigris.org/tigris_transitional.dtd">
<html>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="Translator" content="Sergio Ivan MARCIN" />
<head>
  <title>LG3D Core Project</title>
</head>
<body>

<div id="projectdocumentview" class="app">

  <a href="../zh/index.html">
    <img vspace="0" hspace="3"
      alt="Chinese (simp) page"
      style="border: 1px solid ; float: right; width: 48px;"
      src="../images/icon/lang-chinese-simp.png" />
  </a>
  <a href="../de/index.html">
    <img vspace="0" hspace="3"
      alt="German page"
      style="border: 1px solid ; float: right; width: 48px;"
      src="../images/icon/lang-german.png" />
  </a>
  <a href="../ja/index.html">
    <img vspace="0" hspace="3"
      alt="Japanese page"
      style="border: 1px solid ; float: right; width: 48px;"
      src="../images/icon/lang-japanese.png" />
  </a>
  <a href="../index.html">
    <img vspace="0" hspace="3"
      alt="English page"
      style="border: 1px solid ; float: right; width: 48px;"
      src="../images/icon/lang-english.png" />
  </a>

<h2>Bienvenido al Proyecto de Looking Glass Core!</h2>

<p>
  <a href="/branding/images/lg3d-core/lg_snapshot.png">
    <img vspace="0" hspace="3"
      alt="Project Looking Glass" title="Project Looking Glass"
      style="border: 2px solid ; float: right; width: 200px; height: 145px;"
      src="/branding/images/lg3d-core/lg_snapshot-s.png" />
  </a>
El proyecto Looking Glass esta basado en en la tecnolog&iacute;a Java
y proporciona al usuario de una interacci&oacute;n mejorada con el 
escritorio y aplicaciones de su computadora.Esto lo logra atrav&eacute;s del 
uso de ventanas y visualizaciones en 3D.&nbsp; El desarrollo 
del proyecto es Open Source, que se basa y evoluciona de un proyecto de 
tecnolog&iacute;as avanzadas de Sun Mycrosystems.&nbsp; LG3D soportar&aacute;
poder ejecutar aplicaciones existentes sin modificaci&oacute;n alguna en un espacio
en 3D, as&iacute; tambi&eacute;n como API's para desarrollar administradores de 
Ventanas y aplicaciones en 3D.&nbsp; En este momento, la integraci&oacute;n con 
aplicaciones existentes es soportado por plataformas Linux.
</p>

<p>
El proyecto tiene la intenci&oacute;n de romper con 2 limitantes -- La 
limitaci&oacute;n de 2D del escritorio actual y la manera en que el 
escritorio de evoluciona.&nbsp;El proyecto Looking Glass aun 
est&aacute; en su infancia.&nbsp; Se necesitan explorar muchas ideas y 
posibilidades.&nbsp; Estamos liberando el c&oacute;digo de Looking Glass a
toda la comunidad para explorar cada aspecto de la tecnolog&iacute;a en vez
de tener un acceso restringido a unos cuantos privilegiados. Nosotros
creemos que este desarrollo abierto es un excelente modelo para alcanzar
esta gran oportunidad.&nbsp; As&iacute; que tu participaci&oacute;n es muy bienvienida.
</p>

<p>
La Tecnolog&iacute;a Java es el principal lenguaje para desarrollas.&nbsp; 
Creemos que es una buena opci&oacute;n especialmente por las ganancias
sobre la productividad que brinda y el amplio conjunto de API's que
se pueden utilizar. Habiendo dicho que se planea soportar c++ Bindings, 
para que las aplicaciones nativas puedan interactuar directamente con el sistema. 
</p>

<p>&nbsp;&nbsp; <a href="lg3d-faq.html">Preguntas Frecuentes</a></p>
<center>
<table style="width: 100%; text-align: left;" border="1" cellpadding="4"
 cellspacing="4">
  <tbody>
    <tr>
      <td style="vertical-align: top;">
      <h3>Funcionalidad Clave Soportada</h3>
      <p>
Actualmente nos estamos enfocando en proveer la funcionalidad central
para impulsar la exploraci&oacute;n en 3D y refinar la plataforma inicial.
.&nbsp; La plataforma actual soporta las siguientes funciones clave:
      </p>
      <ul>
        <li>Integracion inicial com aplicaciones existentes(Cliente X11)</li>
        <li>Plataforma SceneGraph cliente-Servidor</li>
        <li>Comportamiento de ejecuci&oacute;n en el servidor (Serverside) </li>
        <li>Soporte generico del sistema de eventos de Java </li>
        <li>Soporte inicial de un API para construir componentes en 3D</li>
        <li>Soporte de utiler&iacute;as de retroalimentaci&oacute;n animada al usuario.</li>
      </ul>
      </td>
      <td style="vertical-align: top;">
      <h3>Y para aquellos que no pueden esperar....</h3>
      <p>
Para iniciar y configurar un ambiente para desarrolladores vaya la secci&oacute;n
To get started and to set up a development environment refer to the "<a href="lg3d-getting-started.html">Iniciando con el Proyecto 
Looking Glass</a>" document.
      </p>
      <p>
Una vez que tenga un ambiente de desarrollo, se recomienda leer la 
Once you have a working development environment, you should read the
"<a href="lg3d-developers-guide.html">Gu&iacute;a de Desarrollo del Proyecto Looking Glass </a>" 
, la cual contiene informaci&oacute;n detallada sobre el proyecto looking Glass y de como 
hacer aplicaciones 3D para este proyecto. Y los
 "<a href="tutorial/">Tutoriales del Proyecto Looking Glass</a>" tambi&eacute;n explicacn 
como programar aplicaciones aplicaciones para LG3D (Looking Glass 3D)
      </p>
      <p>
Cuando est&eacute; listo para contribuir con c&oacute;digo o documentaci&oacute;n al proyecto,
por favor revise la secci&oacute;n 
"<a href="https://lg3d.dev.java.net/contribute.html">Contribuyendo al Proyecto
 Looking Glass</a>" para aprender como puede hacerlo.
      </p>
      </td>
    </tr>
  </tbody>
</table>
</center>
<br />

<h3>Desarrollo por  Fases</h3>

<p>
Debido a que los problemas que se quieren atacar son muy grandes, y 
a que queremos reunir la retroalimentaci&oacute;n de todos sobre la 
plataforma, estamos planeando un desarrollo por fases, el siguiente 
es un esquema del plan de desarrollo.

</p>

<table style="width: 100%; text-align: left;" border="0" cellpadding="2"
 cellspacing="2">
  <tbody>
    <tr>
      <td style="vertical-align: top;">Fase 0</td>
      <td style="vertical-align: top;">-Jun</td>
      <td style="vertical-align: top;"> 
Hecho  <a href="http://www.sun.com/software/looking_glass"> 
Demo de prueba de concepto</a> para demostrar nuestra visi&oacute;n de
 las posibilidades de un escritorio 3D. Al mismo tiempo, se inici&oacute;
 le refinamiento de la arquitectura y la implementaci&oacute;n del sistema 
en Java3D.
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">Fase 1</td>
      <td style="vertical-align: top;">Jul,'04 - Mar,'05</td>
      <td style="vertical-align: top;">
Open Source de la versi&oacute;n de desarrolladores e inicio de mejora
de la plataforma y creaci&oacute; del API.
El API inicial es considerado como punto de partida y tiene la 
intenci&oacute;n de evolucionar bastante en base a la retroalimentaci&oacute;n 
que recibamos.%nbsp; Por lo tanto tome en cuenta que el API ser&aacute; 
actualizado constantemente durante esta fase.      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">Fase 2</td>
      <td style="vertical-align: top;">Apr,'05 -</td>
      <td style="vertical-align: top;">
Terminar el API y cambiar el enfoque a desarrollar aplicaciones en 3D.
      </td>
    </tr>
    <tr>
      <td style="vertical-align: top;">Fase 3</td>
      <td style="vertical-align: top;">Pendiente</td>
      <td style="vertical-align: top;">
      </td>
    </tr>
  </tbody>
</table>
<h3>Sub-proyectos en Desarrollo</h3>

<p> 
Aqui tenemos una lista de subproyetos que son desarrollados
bajo lg3d-core( y lg3d-demo-apps, lg3d-incubator).

Muchas gracias por sus contribuciones! si est&aacute; interesado en proponer
algo, excelente! Por favor conteste a  <a
href="http://www.javadesktop.org/forums/thread.jspa?threadID=3482&amp;tstart=0">
esta discuci&oacute;n </a> en el foro de javadesktop.org y haganos saber sus ideas.

Por favor revise la pagina <a href="https://lg3d-x11.dev.java.net/"> Proyecto
lg3d-x11 </a> para temas especificos de la integraci&oacute;n con X11
</p>
<ul>
  <li>
    <b>Javadoc</b><br />
    Kirk Turner (gameldar)
  </li>
</ul>
<ul>
  <li>
    <a href="https://lg3d-core.dev.java.net/tutorial/">
      <b>Tutoriales del Proyecto Looking Glass </b><br />
    </a>
    Kirk Turner (gameldar)
  </li>
</ul>
<ul>
  <li>
    <b>Mecanismo de configuracion del Administrador de Escenas</b> -
    <a href="https://lg3d-core.dev.java.net/issues/show_bug.cgi?id=37"> 
      Numero 37 </a><br />
    Steve Perry (protohi)
  </li>
</ul>
<ul>
  <li>
    <a href="https://lg3d-incubator.dev.java.net/">
      <b>Proyectos de la incubadora-lg3d</b><br />
    </a>
    <ul>
      <li>
        <b>PingPong</b> - Johan Glaser (hansignlaser)
      </li>
      <li>
        <b>Launcher</b> - Henrik Baastrup (hbaastrup)
      </li>
      <li>
        <b>Navegador web 3D</b> - Chris Rondot (beer28), David Vallejo (dragmor)
        and David Weizades (ddew)
      </li>
      <li>
        <b>Reproductor JMF para LG3D</b> - sat1196
      </li>
    </ul>
  </li>
</ul>
<ul>
  <li>
    <b>Documentos Locales</b><br />
    <ul>
      <li>
        <a href="ja/trans-support/index.html">
          <b>Japon&eacute;s</b><br />
        </a>
        Yuka Kamiya (kyuka), Hideyuki Otokawa (otokawa), Yuichi Sakuraba
        (sakuraba), Kazuhiro Kazama (kazama) and Endo Yasuyuki (yasuyuki)
      </li>
      <li>
        <b>Alem&aacute;n</b><br />
        Christian Ost (cost)
      </li>
      <li>
        <b>Chino</b><br />
        Wen Peng (wenpeng)
      </li>
      <li>
        <b>Holand&eacute;s</b><br />
        Martjin Kools (marve)
      </li>
      <li>
        <b>Espa&#241;ol</b><br />
        Sergio Ivan Marcin (bitbeat)
      </li>
      <li>
        <b>Italiano</b><br />
        Giordano Fracasso (giosquad) and Danilo Bonardi (trix180)
      </li>
    </ul>
    <ul>
      <li>
        <b>Referencias</b>
        <ul>
          <li>
            <a href="ja/trans-support/lg3d-translation-filestyle_en.html">
              Gu&iacute;a de Estilo para Traducciones<br />
            </a>
          </li>
        </ul>
      </li>
    </ul>
  </li>
</ul>
<ul>
  <li>
    <a href="http://wiki.java.net/bin/view/Javadesktop/ProjectLookingGlass#KnowledgeBase">
      <b>Knowledge-base</b> (wiki)
    </a>
    <br />
Martijn Kools (marve), David Weizades (ddew), Paul Shoemaker (t0rn)
  </li>
</ul>
<ul>
  <li>
    <a href="http://wiki.java.net/bin/view/Javadesktop/ProjectLookingGlass#UiIdeas">
      <b>Ideas y Discuciones de la Interfaz 3D UI</b> (wiki)
    </a>
    <br />
Paul Shoemaker (t0rn), qgnjon, David Weizades (ddew)<br />
    <a href="http://www.javadesktop.org/forums/thread.jspa?threadID=4372&messageID=24567">
      Discusi&oacute;n para notificar sobre actualizaci&oacute;n de contenido
    </a>
  </li>
</ul>

<p>
Para aquellos participando en alguna discuci&oacute;n o desarrollo,y les gustar&iacute;a
anunciar que se van a ausentar un tiempo, haganlo libremente dejando un 
mensaje en el foro 
For those who are participating some on-going discussions or development,
and would like to inform your absence, please feel free to post a message to
  <a href="http://www.javadesktop.org/forums/thread.jspa?threadID=3887&tstart=15">
    Mensajes sobre Vacaciones
  </a>

</p>

<h3>Areas donde necesitamos ayuda</h3>

<p>
Aqu&iacute; est&aacute; una lista de las areas en donde necesitamos la participaci&oacute;n 
de la comunidad:
</p>

<ul>
  <li>Refinar el API 3D de LG3D, hay que hacer muchas mejoras!</li>
  <li>Explorar el dise&#241;o de la interfaz gr&aacute;fica del administrador de 
ventanas en 3D - donde los siguientes documentos est&aacute;n disponibles.
<br />
    <a href="lg3d-ui-design.html"> Disucuci&oacute;n del Dise&#241;o de la 
interfaz de Looking Glass </a> y <a href="lg3d-related-technologies.html">
Tecnolog&iacute;as Relacionadas </a> </li>
  <li>Exploraci&oacute;n de nuevas aplicaciones en 3D</li>
  <li>Implementaci&oacute;n y API en C++ del lado del Cliente.</li>
  <li>Compatibilidad con GNOME/KDE</li>
  <li>Sugerencias?</li>
</ul>

<p>
Pro favor revise <a href="https://lg3d-x11.dev.java.net/"> La P&aacute;gina 
del Proyecto lg3d-x11 </a> para temas espec&iacute;ficos de la integraci&oacute;n 
con X11.Apreciamos toda la ayuda que puedan brindar.
</p>

<h3>Como Contribuir</h3>

<p>
Como primer paso, considere convertirse en observador del proyecto,
trate de familiarizarse con el proyecto y participar en el 
<a href="http://www.javadesktop.org/forums/forum.jspa?forumID=56"> 
Foro de Discuci&oacute;n </a>.
Por favor revise el documento <a
href="https://lg3d.dev.java.net/contribute.html">Contribuyendo al 
Proyecto Looking Glass</a> para m&aacute;s informaci&oacute;n de como contribuir 
al proyecto.Vea la <a
href="https://javadesktop.dev.java.net/govern.html"> Gu&iacute;a de la 
comunidad de Java Desktop</a> para obtener gu&iacute;as generales de como 
participar en proyectos de la comunidad de JavaDesktop, como lo es 
el proyecto Looking Glass
</p>

<h3><a name="Reporting_Issues"></a>Reporte de Fallas y Problemas</h3>

<p>
La informaci&oacute;n de problemas actuales puede ser encontrada en el 
Information on current problems and issues can be found by clicking on
<a href="servlets/ProjectIssues"><b>Issue tracker</b></a> dentro de la secci&oacute;n <b>Project Tools</b> en la barra lateral. Puede buscar sobre fallas y defectos o sobre alg&uacute;n
problema en espec&iacute;fico. Si encuentra alguna problem&aacute;tica que aun no
ha sido documentada, por favor haga un reporte sobre la falla. Talves quiera
buscar en el archivo de e-mails en el<a
href="http://www.javadesktop.org/forums/forum.jspa?forumID=56">  foro de
discucion en javadesktop.org </a> para encontrar informaci&oacute;n al respecto.
</p>

<p>
Cuando reporte una falla, por favor trate de ser espec&iacute;fico sobre su 
computador y ambiente de trabajo as&iacute; como los sintomas que encuentra. 
Cuando encuentre que el sistema de bloquea, los siguientes archivos 
de registro le proporcionar&aacute;n de informaci&oacute;n &uacute;til:
</p>
<ul>
  <li><tt>/var/tmp/lgserver.log</tt></li>
  <li><tt>/var/log/XFree86.0.log</tt><br />
Este archivo de registro puede ser muy grande. Porfavor ponga atenci&oacute;n 
a la l&iacute;nea que empieza con <tt>(EE)</tt>, y reporte cualquier l&iacute;nea que 
se vea sospechosa.</li>
  <li><tt>hs_err_pid####.log</tt><br />
Este log tambipen puede ser muy largo. Por favor, env&iacute;e las l&iacute;neas que est&aacute;n
entre el inicio del archivo y la l&iacute;nea que dice 
<br />
"<tt>--- P R O C E S S ---</tt>". </li>
</ul>
<p> Si es nuevo con el Issue tracking (reporte de fallas), talves quiera tomarse
un momento para revisar los siguientes documentos introductorios:/p>
<ul>
  <li><a href="https://javadesktop.dev.java.net/reportbug.html">Gu&iacute;a paso a paso</a> 
para llenar un reporte de bugs que sea &uacute;til</li>
  <li><a
 href="https://www.dev.java.net/nonav/docs/ddIssues_EnterModify.html#entryfields">A
Introducci&oacute;n r&aacute;pida al Issue Tracking</a> </li>
</ul>
<h3><a name="Staying_Connected"></a>Manteniendose Informado</h3>
<p> 
El proyecto Looking Glass continuamente evoluciona. La mejor manera 
de mantenerse al d&iacute;a con el proyecto Looking Glass es a traves de la 
lista de correos de Looking Glass. Haga click en <b>Listas de Correos (Mailing Lists)</b>
 en la secci&oacute;n de <b> Herramientas de Proyectos(Proyect Tools)</b> de la barra lateral en <a
 href="https://lg3d.dev.java.net/">https://lg3d.dev.java.net/</a>.
Hay muchas listas de correos de donde escojer dependiendo de su grado de inter&eacute;s.
</p>
<ul>
  <li>Si solo est&aacute; interesado en lo nuevo de LG3D <span style="color: red;">what's new</span>,
 suscr&iacute;base a <a href="mailto:announce@lg3d.dev.java.net">announce@lg3d.dev.java.net</a>.<br />
  </li>
</ul>
<ul>
  <li>Si es un desarrollador y <span style="color: red;"> desea discutir detalles del
desarrollo del Proyecto Looking Glass </span>, suscr&iacute;base a <a
 href="mailto:interest@lg3d.dev.java.net">interest@lg3d.dev.java.net</a>.
  </li>
</ul>
<ul>
  <li>Si est&aacute; interesado en <span style="color: red;">detalles de Licencias</span>, suscr&iacute;base a
 <a href="mailto:lg3d_license@dev.java.net">lg3d_license@dev.java.net</a>.<br />
  </li>
</ul>
<h3>Recursos</h3>
<ul>
  <li> <a href="lg3d-faq.html"> FAQ - Preguntas Frecuentes </a>
  </li>
  <li> <a href="lg3d-getting-started.html"> Empezando con el 
 Proyecto Looking Glass</a>
  <ul>
    <li> <a href="nvidia-driver-install-tips.html"> Tips de instalaci&oacute;n 
del driver de NVIDIA
 </a> </li>
    <li> <a href="dri-driver-install-ati-radeon.html"> Instalaci&oacute;n del Driver DRI
para la ATI Radeon </a> </li>
    <li> <a href="jds-3d-acceleration.html"> Aceleraci&oacute;n 3D en la laptop Tadpole Talin JDS  (ATI Radeon M9) </a> </li>
    <li> <a href="dri-driver-install-ati-radeon-nonrpm.html"> Instrucciones de instalaci&oacute;n del driver binario de ATI para distribuciones no basadas en rpm.</a>

					<p>Escrito pensando en Slackware pero la mayor&iacute;a de
los pasos aplican para otras distribuciones.</p>
    </li>
  </ul>
  </li>
  <li> <a href="lg3d-developers-guide.html"> Gu&iacute;a de desarrolladores de Project Looking Glass
</a> </li>
  <li><a href="tutorial/">tutoriales de Project Looking Glass</a></li>
  <li> <a
 href="http://www.javadesktop.org/forums/forum.jspa?forumID=56">Foro javadesktop.org
: Project Looking Glass 3D </a> </li>
  <li> <a href="https://lg3d-core.dev.java.net/issues/query.cgi">Busquedas del Issue
Tracker </a> </li>
  <li> <a
 href="https://lg3d-core.dev.java.net/files/documents/1834/5964/J1-2004-TS1586-final.pdf"> diapositivas de JavaOne
2004 (PDF 900KB) </a> </li>
  <li> <a
 href="https://lg3d-core.dev.java.net/files/documents/1834/7596/LG3DAPIOverview-DRAFT.pdf">
 BORRADOR - LG3D API Design Overview (PDF 330KB) </a> </li>
  <li> <a href="lg3d-related-technologies.html"> Tecnolog&iacute;as Relacionadas </a>
  </li>
  <li> <a href="lg3d-ui-design.html"> Discuci&oacute;n del Dise&#241;o de la Interfaz gr&aacute;fica</a> </li>
</ul>

<h3>Unas ultimas palabras...</h3>

<p>
Muchas gracias por su inter&eacute;s en el proyecto y por tomarse un tiempo
para leer esto.&nbsp; Esperamos que se pueda unir al proyecto y explorar
esta divertida oportunidad junto con nosotros.


</p>

<p>
Equipo de Desarrollo del Project Looking Glass.
</p>

<hr />
<small> $Revision: 1.1 $ $Date: 2006-05-09 17:46:24 $ </small>
</div>
</body>
</html>
